-- 开始计算业态层级的结转利润对比
    SELECT  
        a.清洗时间,
        a.清洗版本,
        a.公司,
        a.投管代码,
        a.项目GUID,
        a.项目,
        a.推广名,
        a.获取日期,
        a.我方股比,
        a.是否并表,
        a.合作方,
        a.是否风险合作方,
        a.地上总可售面积 /10000.0 as 地上总可售面积, -- 单位万平米
        a.项目地价 /100000000.0 as 项目地价, -- 单位亿元
        a.盈利规划上线方式,
        a.产品类型,
        a.产品名称,
        a.装修标准,
        a.商品类型,
        a.明源匹配主键,
        a.业态组合键,
        
        -- 立项利润
        a.立项货值 /100000000.0 as 立项货值, -- 单位亿元
        a.税后利润 /100000000.0 as 税后利润, -- 单位亿元
        a.销售净利率,

        -- 实际结转
        a.本年结转签约_实际,
        a.本年结转签约不含税_实际,
        a.本年结转签约面积_实际,
        a.本年结转净利润_实际,
        -- a.本年结转报表利润_实际,
        case when a.是否并表 = '我司并表' then a.本年结转净利润_实际 else isnull(a.我方股比,0)/100.0 * a.本年结转净利润_实际 end as 本年结转报表利润_实际,
        case when a.本年结转签约不含税_实际 <> 0 then a.本年结转净利润_实际 / a.本年结转签约不含税_实际 else 0 end as 本年结转净利率_实际,
        a.本年结转签约均价_实际,
        a.本年结转营业成本单方_实际,
        a.本年结转营销费用单方_实际,
        a.本年结转管理费用单方_实际,
        a.本年结转税金单方_实际,    

        -- 本月实际结转
        a.本月结转签约_实际,
        a.本月结转签约不含税_实际,
        a.本月结转签约面积_实际,   
        a.本月结转净利润_实际,
        case when a.是否并表 = '我司并表' then a.本月结转净利润_实际 else isnull(a.我方股比,0)/100.0 * a.本月结转净利润_实际 end as 本月结转报表利润_实际,
        case when a.本月结转签约不含税_实际 <> 0 then a.本月结转净利润_实际 / a.本月结转签约不含税_实际 else 0 end as 本月结转净利率_实际,
        a.本月结转签约均价_实际,
        a.本月结转营业成本单方_实际,
        a.本月结转营销费用单方_实际,
        a.本月结转管理费用单方_实际,
        a.本月结转税金单方_实际,   

        -- --计划结转（预算）
        a.本年结转签约_预算,
        a.本年结转签约不含税_预算,
        a.本年结转签约面积_预算,
        a.本年结转净利润_预算,
        -- 如果并表方式为“我司并表”，则报表利润=净利润，否则用我方股比*净利润
        case when a.是否并表 = '我司并表' then a.本年结转净利润_预算 else isnull(a.我方股比,0)/100.0 * a.本年结转净利润_预算 end as 本年结转报表利润_预算, 

        a.本年结转净利率_预算,
        a.本年结转签约均价_预算,

        a.营业成本单方_预算,
        a.营销费用单方_预算,
        a.管理费用单方_预算,
        a.税金单方_预算,
        -- 较预算对比
        a.本年结转净利润_预算 as 本年预算净利润,
        case when  a.本年结转净利润_预算 =0  then 0 else (a.本年结转净利润_实际 - a.本年结转净利润_预算) / a.本年结转净利润_预算 end as 本年预算净利润完成率,
        -- 偏差原因分析
        case when  a.本年结转签约均价_实际 <> 0  and a.本年结转签约均价_预算 <> 0  and a.本年结转签约面积_实际 <> 0
           then  (a.本年结转签约均价_实际 - a.本年结转签约均价_预算) * case when a.产品类型='地下室/车库' then a.本年结转签约面积_实际 /100000000.0 else a.本年结转签约面积_实际 /10000.0 end else 0 end   as 售价下降, -- (25年实际签约均价-25年预算签约均价)/25年预算签约均价
        case when  a.本年结转营业成本单方_实际 <> 0  and a.营业成本单方_预算 <> 0  and a.本年结转签约面积_实际 <> 0
           then  (a.本年结转营业成本单方_实际 - a.营业成本单方_预算) * case when a.产品类型='地下室/车库' then a.本年结转签约面积_实际 /100000000.0 else a.本年结转签约面积_实际 /10000.0 end else 0 end   as 成本增加, -- (25年实际营业成本单方-25年预算营业成本单方)/25年预算营业成本单方
        case when  a.本年结转管理费用单方_实际 <> 0  and a.管理费用单方_预算 <> 0  and a.本年结转签约面积_实际 <> 0
           then  (a.本年结转管理费用单方_实际 - a.管理费用单方_预算) * case when a.产品类型='地下室/车库' then a.本年结转签约面积_实际 /100000000.0 else a.本年结转签约面积_实际 /10000.0 end else 0 end   as 管理费用增加, -- (25年实际管理费用单方-25年预算管理费用单方)/25年预算管理费用单方
        case when  a.本年结转营销费用单方_实际 <> 0  and a.管理费用单方_预算 <> 0  and a.本年结转签约面积_实际 <> 0
           then  (a.本年结转营销费用单方_实际 - a.管理费用单方_预算) * case when a.产品类型='地下室/车库' then a.本年结转签约面积_实际 /100000000.0 else a.本年结转签约面积_实际 /10000.0 end else 0 end   as 营销费用增加, -- (25年实际营销费用单方-25年预算营销费用单方)/25年预算营销费用单方
        case when  a.本年结转税金单方_实际 <> 0  and a.税金单方_预算 <> 0  and a.本年结转签约面积_实际 <> 0
           then  (a.本年结转税金单方_实际 - a.税金单方_预算) * case when a.产品类型='地下室/车库' then a.本年结转签约面积_实际 /100000000.0 else a.本年结转签约面积_实际 /10000.0 end else 0 end   as 税金增加, -- (25年实际税金单方-25年预算税金单方)/25年预算税金单方
        NULL as 其他, -- 其他

        --第二年结转
        a.[第二年结转面积_实际] ,
        a.[第二年结转金额_实际] ,
        a.[第二年结转金额不含税_实际] ,
        a.[第二年结转利润_实际] ,
        --第三年结转
        a.[第三年结转面积_实际] ,
        a.[第三年结转金额_实际] ,
        a.[第三年结转金额不含税_实际] ,
        a.[第三年结转利润_实际] ,

        --第四年结转
        a.[第四年及之后结转面积_实际] ,
        a.[第四年及之后结转金额_实际] ,
        a.[第四年及之后结转金额不含税_实际] ,
        a.[第四年及之后结转利润_实际] 
    FROM 业态结转利润对比表 a
    inner join [172.16.4.141].erp25.dbo.vmdm_projectFlagnew b on a.项目GUID = b.projGUID
    -- LEFT JOIN (
    --     SELECT  
    --         项目GUID,
    --         CASE WHEN SUM(净利润_25年预算) <> 0 THEN '是' ELSE '否' END AS 项目是否有利润预算,
    --         CASE WHEN SUM(净利润_24年签约) <> 0 THEN '是' ELSE '否' END AS 项目是否有24年利润,
    --         CASE WHEN SUM(签约不含税_25年预算) = 0 THEN 0 ELSE SUM(净利润_25年预算) / SUM(签约不含税_25年预算) END AS 项目预算净利率,
    --         CASE WHEN SUM(签约不含税_25年签约) = 0 THEN 0 ELSE SUM(净利润_25年签约) / SUM(签约不含税_25年签约) END
    --             - CASE WHEN SUM(签约不含税_25年预算) = 0 THEN 0 ELSE SUM(净利润_25年预算) / SUM(签约不含税_25年预算) END AS 项目实际较预算偏差,
            
    --         CASE WHEN SUM(签约不含税_24年签约) = 0 THEN 0 ELSE SUM(净利润_24年签约) / SUM(签约不含税_24年签约) END AS 项目24年净利率,
    --         CASE WHEN SUM(签约不含税_25年签约) = 0 THEN 0 ELSE SUM(净利润_25年签约) / SUM(签约不含税_25年签约) END 
    --             - CASE WHEN SUM(签约不含税_24年签约) = 0 THEN 0 ELSE SUM(净利润_24年签约) / SUM(签约不含税_24年签约) END AS 项目实际较24年对比,
            
    --         CASE WHEN SUM(立项货值) = 0 THEN 0 ELSE SUM(税后利润) / SUM(立项货值) END AS 项目立项净利率,
    --         CASE WHEN SUM(签约不含税_25年签约) = 0 THEN 0 ELSE SUM(净利润_25年签约) / SUM(签约不含税_25年签约) END 
    --             - CASE WHEN SUM(立项货值) = 0 THEN 0 ELSE SUM(税后利润) / SUM(立项货值) END AS 项目实际较立项对比
    --     FROM 业态签约利润对比表  
    --     WHERE DATEDIFF(DAY, GETDATE(), 清洗时间) = 0
    --     GROUP BY 项目GUID
    -- ) b ON a.项目GUID = b.项目GUID -- AND a.业态组合键 = b.业态组合键
    WHERE DATEDIFF(DAY, GETDATE(), a.清洗时间) = 0 and isnull(b.是否纳入动态利润分析,'') <> '否'