
-- 项目层级结转利润对比
-- 插入项目临时表
SELECT 
    --a.清洗时间,
    --a.清洗版本,
    c.DevelopmentCompanyGUID as 平台公司GUID,
    a.公司,
    a.投管代码,
    a.项目GUID,
    max(a.项目) as 项目,
    max(a.推广名) as 推广名 ,
    max(a.获取日期) as 获取日期 ,
    max(a.我方股比) as 我方股比,
    max(a.是否并表) as 是否并表,
    max(a.合作方) as 合作方,
    max(a.是否风险合作方) as 是否风险合作方,
    max(a.地上总可售面积) as 地上总可售面积,
    max(a.项目地价) as 项目地价
INTO #proj
FROM 业态签约利润对比表 a
inner join data_wide_dws_mdm_Project b on a.项目GUID = b.ProjGUID
inner join data_wide_dws_s_Dimension_Organization c on b.buguid = c.OrgGUID
inner join [172.16.4.141].erp25.dbo.vmdm_projectFlagnew d on a.项目GUID = d.projGUID
WHERE datediff(day, a.清洗时间, getdate()) = 0 and isnull(d.是否纳入动态利润分析,'') <> '否'
GROUP BY     
    -- a.清洗时间,
    -- a.清洗版本,
    c.DevelopmentCompanyGUID,
    a.公司,
    a.投管代码,
    a.项目GUID
    --a.项目,
    --a.推广名
   ---- a.获取日期,
   -- a.我方股比,
   ---- a.是否并表,
   ---- a.合作方,
   -- a.是否风险合作方,
   -- a.地上总可售面积,
   -- a.项目地价


    
-- 实际结转利润
SELECT 
    a.项目GUID,
    SUM(a.本年结转签约_实际) AS 本年结转签约_实际,
    SUM(a.本年结转签约不含税_实际) AS 本年结转签约不含税_实际,
    SUM(case when a.产品类型<>'地下室/车库' then a.本年结转签约面积_实际 else 0 end) AS 本年结转签约面积_实际不含车位,
    SUM(a.本年结转净利润_实际) AS 本年结转净利润_实际,
    CASE WHEN SUM(a.本年结转签约不含税_实际) = 0 THEN 0
    ELSE SUM(a.本年结转净利润_实际) / SUM(a.本年结转签约不含税_实际) END AS 本年结转净利率_实际,

    --本月实际结转
    SUM(a.本月结转签约_实际) AS 本月结转签约_实际,
    SUM(a.本月结转签约不含税_实际) AS 本月结转签约不含税_实际,
    SUM(case when a.产品类型<>'地下室/车库' then a.本月结转签约面积_实际 else 0 end) AS 本月结转签约面积_实际不含车位,
    SUM(a.本月结转净利润_实际) AS 本月结转净利润_实际,
    CASE WHEN SUM(a.本月结转签约不含税_实际) = 0 THEN 0
    ELSE SUM(a.本月结转净利润_实际) / SUM(a.本月结转签约不含税_实际) END AS 本月结转净利率_实际,
    
  
    SUM(a.本年结转净利润_预算) AS 本年结转净利润_预算,
    SUM(a.本年结转签约面积_预算) AS 本年结转签约面积_预算,
    SUM(a.本年结转签约个数_预算) AS 本年结转签约个数_预算,
    SUM(a.本年结转签约_预算) AS 本年结转签约_预算,
    SUM(a.本年结转签约不含税_预算) AS 本年结转签约不含税_预算,



    CASE WHEN SUM(a.本年结转签约不含税_预算) = 0 THEN 0
    ELSE SUM(a.本年结转净利润_预算) / SUM(a.本年结转签约不含税_预算) END  AS 本年结转净利率_预算,

    CASE WHEN SUM(a.本年结转签约不含税_实际) = 0 THEN 0 ELSE SUM(a.本年结转净利润_实际) / SUM(a.本年结转签约不含税_实际) END 
    - CASE WHEN SUM(a.本年结转签约不含税_预算) = 0 THEN 0 ELSE SUM(a.本年结转净利润_预算) / SUM(a.本年结转签约不含税_预算) END as 本年结转净利率实际较预算偏差,

    -- 偏差对比分析
    sum( case when a.本年结转签约均价_实际<> 0  and  a.本年结转签约均价_预算 <> 0 and  a.本年结转签约面积_实际<> 0
       then   (a.本年结转签约均价_实际 - a.本年结转签约均价_预算) * case when a.产品类型='地下室/车库' then a.本年结转签约面积_实际 /100000000.0 else a.本年结转签约面积_实际 /10000.0 end else 0 end )    as 售价下降, -- (25年实际签约均价-25年预算签约均价)/25年预算签约均价
    sum(case when a.本年结转营业成本单方_实际<> 0  and  a.营业成本单方_预算 <> 0 and  a.本年结转签约面积_实际<> 0
        then   (a.本年结转营业成本单方_实际 - a.营业成本单方_预算) * case when a.产品类型='地下室/车库' then a.本年结转签约面积_实际 /100000000.0 else a.本年结转签约面积_实际 /10000.0 end else 0 end )   as 成本增加, -- (25年实际营业成本单方-25年预算营业成本单方)/25年预算营业成本单方
    sum(case when a.本年结转管理费用单方_实际<> 0  and  a.管理费用单方_预算 <> 0 and  a.本年结转签约面积_实际<> 0
        then   (a.本年结转管理费用单方_实际 - a.管理费用单方_预算) * case when a.产品类型='地下室/车库' then a.本年结转签约面积_实际 /100000000.0 else a.本年结转签约面积_实际 /10000.0 end else  0  end ) as 管理费用增加, -- (25年实际管理费用单方-25年预算管理费用单方)/25年预算管理费用单方
    sum(case  when a.本年结转营销费用单方_实际<> 0  and  a.管理费用单方_预算 <> 0 and  a.本年结转签约面积_实际<> 0
        then  (a.本年结转营销费用单方_实际 - a.管理费用单方_预算) * case when a.产品类型='地下室/车库' then a.本年结转签约面积_实际 /100000000.0 else a.本年结转签约面积_实际 /10000.0 end else 0  end)  as 营销费用增加, -- (25年实际营销费用单方-25年预算营销费用单方)/25年预算营销费用单方
    sum(case when a.本年结转税金单方_实际<> 0  and  a.税金单方_预算 <> 0 and  a.本年结转签约面积_实际<> 0
        then  (a.本年结转税金单方_实际 - a.税金单方_预算) * case when a.产品类型='地下室/车库' then a.本年结转签约面积_实际 /100000000.0 else a.本年结转签约面积_实际 /10000.0 end else 0  end ) as 税金增加, -- (25年实际税金单方-25年预算税金单方)/25年预算税金单方
    NULL as 其他, -- 其他

        --第二年结转
    sum(a.[第二年结转面积_实际]) as 第二年结转面积_实际 ,
    sum(a.[第二年结转金额_实际]) as 第二年结转金额_实际 ,
    sum(a.[第二年结转金额不含税_实际] ) as 第二年结转金额不含税_实际 ,
    sum(a.[第二年结转利润_实际]) as  第二年结转利润_实际,
    sum(case when a.是否并表 = '我司并表' then a.第二年结转利润_实际 else isnull(a.我方股比,0)/100.0 * a.第二年结转利润_实际 end ) as 第二年结转报表利润_实际,
    case when sum(a.[第二年结转金额不含税_实际] )  =0  then  0  else sum(a.[第二年结转利润_实际]) / sum(a.[第二年结转金额不含税_实际] )  end as 第二年结转净利率_实际,
    --第三年结转
    sum(a.[第三年结转面积_实际]) as 第三年结转面积_实际 ,
    sum(a.[第三年结转金额_实际]) as 第三年结转金额_实际 ,
    sum(a.[第三年结转金额不含税_实际]) as 第三年结转金额不含税_实际,
    sum(a.[第三年结转利润_实际]) as 第三年结转利润_实际,
    sum(case when a.是否并表 = '我司并表' then a.第三年结转利润_实际 else isnull(a.我方股比,0)/100.0 * a.第三年结转利润_实际 end ) as 第三年结转报表利润_实际,
    case when sum(a.[第三年结转金额不含税_实际] )  =0  then  0  else sum(a.[第三年结转利润_实际]) / sum(a.[第三年结转金额不含税_实际] )  end as 第三年结转净利率_实际,

    --第四年结转
    sum(a.[第四年及之后结转面积_实际]) as 第四年及之后结转面积_实际 ,
    sum(a.[第四年及之后结转金额_实际]) as 第四年及之后结转金额_实际,
    sum(a.[第四年及之后结转金额不含税_实际]) as 第四年及之后结转金额不含税_实际 ,
    sum(a.[第四年及之后结转利润_实际]) as 第四年及之后结转利润_实际,
    sum(case when a.是否并表 = '我司并表' then a.第四年及之后结转利润_实际 else isnull(a.我方股比,0)/100.0 * a.第四年及之后结转利润_实际 end ) as 第四年及之后结转报表利润_实际,
    case when sum(a.[第四年及之后结转金额不含税_实际] )  =0  then  0  else sum(a.[第四年及之后结转利润_实际]) / sum(a.[第四年及之后结转金额不含税_实际] )  end as 第四年及之后结转净利率_实际
INTO #lr
FROM 业态结转利润对比表 a
WHERE DATEDIFF(DAY, a.清洗时间, GETDATE()) = 0
GROUP BY a.项目GUID



-- 查询最终结果
SELECT  
    -- p.清洗时间,
    --p.清洗版本,
    p.公司,
    p.投管代码,
    p.项目GUID,
    p.项目,
    p.推广名,
    p.获取日期,
    p.我方股比,
    p.是否并表,
    p.合作方,
    p.是否风险合作方,
    p.地上总可售面积 /10000.0 as 地上总可售面积, -- 单位万平米
    p.项目地价 /100000000.0 as 项目地价, -- 单位亿元
    

    -- 实际结转
    lr.本年结转签约_实际,
    lr.本年结转签约不含税_实际,
    lr.本年结转签约面积_实际不含车位,
    lr.本年结转净利润_实际,

    lr.本月结转签约_实际,
    lr.本月结转签约不含税_实际,
    lr.本月结转签约面积_实际不含车位,
    lr.本月结转净利润_实际,
    lr.本月结转净利率_实际,


    -- 本年预算
    lr.本年结转签约面积_预算,
    lr.本年结转签约个数_预算,
    lr.本年结转签约_预算,
    lr.本年结转签约不含税_预算,
    lr.本年结转净利润_预算,
    case when lr.本年结转签约不含税_预算 = 0 then 0 else lr.本年结转净利润_预算 / lr.本年结转签约不含税_预算 end as 本年结转净利率_预算,
    case when p.是否并表 = '我司并表' then lr.本年结转净利润_实际 else isnull(lr.本年结转净利润_实际,0) * p.我方股比 /100.0 end as 本年结转报表利润_实际,
    case when lr.本年结转签约不含税_实际 = 0 then 0 else lr.本年结转净利润_实际 / lr.本年结转签约不含税_实际 end as 本年结转净利率_实际,

    -- 较预算对比
    lr.本年结转净利润_预算 as 本年预算净利润,
    
    case when lr.本年结转净利润_预算 = 0 then 0 else lr.本年结转净利润_实际 / lr.本年结转净利润_预算 end as 本年实际完成率  ,
    lr.本年结转净利率_预算 as 本年预算净利率,
   -- lr.本年结转净利率_实际 as 本年实际净利率,
    lr.本年结转净利率实际较预算偏差,
    -- 预实偏差原因对比
    lr.售价下降,
    lr.成本增加,
    lr.管理费用增加,
    lr.营销费用增加,
    lr.税金增加,
    lr.其他,

    --第二年结转
    lr.[第二年结转面积_实际] ,
    lr.[第二年结转金额_实际] ,
    lr.[第二年结转金额不含税_实际] ,
    lr.[第二年结转利润_实际] ,
    lr.[第二年结转报表利润_实际] ,
    lr.[第二年结转净利率_实际],
    --第三年结转
    lr.[第三年结转面积_实际] ,
    lr.[第三年结转金额_实际] ,
    lr.[第三年结转金额不含税_实际] ,
    lr.[第三年结转利润_实际] ,
    lr.[第三年结转报表利润_实际] ,
    lr.[第三年结转净利率_实际],

    --第四年结转
    lr.[第四年及之后结转面积_实际] ,
    lr.[第四年及之后结转金额_实际] ,
    lr.[第四年及之后结转金额不含税_实际] ,
    lr.[第四年及之后结转利润_实际],
    lr.[第四年及之后结转报表利润_实际] ,
    lr.[第四年及之后结转净利率_实际]
FROM #proj p
LEFT JOIN #lr lr ON p.项目GUID = lr.项目GUID
WHERE 1=1


-- 删除临时表
DROP TABLE #proj
DROP TABLE #lr