CREATE TABLE s_集团开工申请户型明细表智能体数据提取
(
    projguid                                         UNIQUEIDENTIFIER,
    平台公司                                         VARCHAR(200),
    项目名                                           VARCHAR(200),
    推广名                                           VARCHAR(200),
    项目代码                                         VARCHAR(200),
    投管代码                                         VARCHAR(200),

    总可售住宅套数_户型总可售住宅住宅套数            DECIMAL(38,10),
    总可售住宅套数_户型总可售住宅住宅90以下          DECIMAL(38,10),
    总可售住宅套数_户型总可售住宅住宅90140平         DECIMAL(38,10),
    总可售住宅套数_户型总可售住宅住宅140180平        DECIMAL(38,10),
    总可售住宅套数_户型总可售住宅住宅180220平        DECIMAL(38,10),
    总可售住宅套数_户型总可售住宅住宅220260平        DECIMAL(38,10),
    总可售住宅套数_户型总可售住宅住宅260平以上       DECIMAL(38,10),

    已推住宅套数_户型已推住宅套数                    DECIMAL(38,10),
    已推住宅套数_户型已推住宅住宅90以下              DECIMAL(38,10),
    已推住宅套数_户型已推住宅住宅90140平             DECIMAL(38,10),
    已推住宅套数_户型已推住宅住宅140180平            DECIMAL(38,10),
    已推住宅套数_户型已推住宅住宅180220平            DECIMAL(38,10),
    已推住宅套数_户型已推住宅住宅220260平            DECIMAL(38,10),
    已推住宅套数_户型已推住宅住宅260平以上           DECIMAL(38,10),

    已售住宅套数_户型已售住宅                        DECIMAL(38,10),
    已售住宅套数_户型已售住宅住宅90以下              DECIMAL(38,10),
    已售住宅套数_户型已售住宅住宅90140平             DECIMAL(38,10),
    已售住宅套数_户型已售住宅住宅140180平            DECIMAL(38,10),
    已售住宅套数_户型已售住宅住宅180220平            DECIMAL(38,10),
    已售住宅套数_户型已售住宅住宅220260平            DECIMAL(38,10),
    已售住宅套数_户型已售住宅住宅260平以上           DECIMAL(38,10),

    去化率_户型去化率住宅住宅90以下                  DECIMAL(38,10),
    去化率_户型去化率住宅住宅90140平                 DECIMAL(38,10),
    去化率_户型去化率住宅住宅140180平                DECIMAL(38,10),
    去化率_户型去化率住宅住宅180220平                DECIMAL(38,10),
    去化率_户型去化率住宅住宅220260平                DECIMAL(38,10),
    去化率_户型去化率住宅住宅260平以上               DECIMAL(38,10),

    极差_最大去化率                                  DECIMAL(38,10),
    极差_最小去化率                                  DECIMAL(38,10),
    极差_户型去化率极差                              DECIMAL(38,10),

    本年已售套数_范围内已售住宅                      DECIMAL(38,10),
    本年已售套数_已售住宅90以下                      DECIMAL(38,10),
    本年已售套数_已售住宅90140平                     DECIMAL(38,10),
    本年已售套数_已售住宅140180平                    DECIMAL(38,10),
    本年已售套数_已售住宅180220平                    DECIMAL(38,10),
    本年已售套数_已售住宅220260平                    DECIMAL(38,10),
    本年已售套数_已售住宅260平以上                   DECIMAL(38,10),

    是否纳入考核                                     VARCHAR(200),
    清洗日期                                         DATETIME
)