-- 由于开工申请表单功能开发延后，先用四个项目的模拟数据进行接口开发使用，并且创建号物理表提供给未来功能开发使用
--  开工申请单表单
drop table 本次新推承诺表
/******[1.1本次新推承诺表] ******/
CREATE TABLE [dbo].[本次新推承诺表](
    [本次新推量价承诺ID] uniqueidentifier NOT NULL PRIMARY KEY,
    [审批单号] Varchar(200),
    [审批单名称] Varchar(200),
	[项目GUID] uniqueidentifier,
	[投管代码] decimal(38,10) NULL,
	[项目名称] nvarchar(255) NULL,
	[承诺时间] nvarchar(255) NULL,
	[本批开工的产品楼栋GUID] nvarchar(max) NULL,
	[本批开工的产品楼栋编码] nvarchar(max) NULL,
	[本批开工的产品楼栋名称] nvarchar(max) NULL,
	[本批开工可售面积] decimal(38,10) NULL,
	[本批开工货值] decimal(38,10) NULL,
	[供货周期] decimal(38,10) NULL,
	[去化周期] decimal(38,10) NULL,
	[本批开工后的项目累计签约回笼] decimal(38,10) NULL,
	[本批开工后的项目累计除地价外直投及费用] decimal(38,10) NULL,
	[本批开工后的项目累计贡献现金流] decimal(38,10) NULL,
	[本批开工后的一年内实现签约] decimal(38,10) NULL,
	[本批开工后的一年内实现回笼] decimal(38,10) NULL,
	[本批开工后的一年内除地价外直投及费用] decimal(38,10) NULL,
	[本批开工后的一年内贡献现金流] decimal(38,10) NULL,
	[未开工楼栋地价] decimal(38,10) NULL,
	[本次开工可收回地价] decimal(38,10) NULL,
	[回收股东占压资金] decimal(38,10) NULL,
	[本批开工的销售均价] decimal(38,10) NULL,
	[本批开工的可售单方成本] decimal(38,10) NULL,
	[本批开工的税后净利润] decimal(38,10) NULL,
	[本批开工的销净率] decimal(38,10) NULL,
	[业态销售均价及销净率承诺] nvarchar(255) NULL
) ON [PRIMARY] TEXTIMAGE_ON [PRIMARY]
GO

INSERT [dbo].[本次新推承诺表] ([本次新推量价承诺ID],[审批单号],[审批单名称], [项目GUID],[投管代码], [项目名称], [承诺时间],[本批开工的产品楼栋GUID], [本批开工的产品楼栋编码] ,[本批开工的产品楼栋名称], [本批开工可售面积], [本批开工货值], [供货周期], [去化周期], [本批开工后的项目累计签约回笼], [本批开工后的项目累计除地价外直投及费用], [本批开工后的项目累计贡献现金流], [本批开工后的一年内实现签约], [本批开工后的一年内实现回笼], [本批开工后的一年内除地价外直投及费用], [本批开工后的一年内贡献现金流], [未开工楼栋地价], [本次开工可收回地价], [回收股东占压资金], [本批开工的销售均价], [本批开工的可售单方成本], [本批开工的税后净利润], [本批开工的销净率], [业态销售均价及销净率承诺]) 
VALUES (newid(),'728-2025-09-02','长沙保利天瑞项目（长沙市岳麓区瓦官口路026项目）_开工申请单_20250902','EE075160-2116-EE11-B3A3-F40270D39969',728, N'长沙保利天瑞项目（长沙市岳麓区瓦官口路026项目）', '2025-08-31',  N'68EAAB92-321B-43DA-83C4-885E61943781', N'68EAAB92-321B-43DA-83C4-885E61943781', N'双拼高级P24', 1.86, 6.37, 5, 7, 6.34, 2.08, 4.26, 1.5, 1.05, 0.3, 0.75, 3.5, 1.2, 4.26, 34390, 30077, 0.57, 0.0979, N'双拼定价38300元/㎡，销净率13%
联排均价30200元/㎡销净率4.2%
叠墅均价24600元/㎡销净率0.28%')
GO
INSERT [dbo].[本次新推承诺表] ([本次新推量价承诺ID],[审批单号],[审批单名称], [项目GUID],[投管代码], [项目名称], [承诺时间],[本批开工的产品楼栋GUID], [本批开工的产品楼栋编码] ,[本批开工的产品楼栋名称], [本批开工可售面积], [本批开工货值], [供货周期], [去化周期], [本批开工后的项目累计签约回笼], [本批开工后的项目累计除地价外直投及费用], [本批开工后的项目累计贡献现金流], [本批开工后的一年内实现签约], [本批开工后的一年内实现回笼], [本批开工后的一年内除地价外直投及费用], [本批开工后的一年内贡献现金流], [未开工楼栋地价], [本次开工可收回地价], [回收股东占压资金], [本批开工的销售均价], [本批开工的可售单方成本], [本批开工的税后净利润], [本批开工的销净率], [业态销售均价及销净率承诺]) 
VALUES (newid(),'1130-2025-09-02','长春保利景阳和煦项目三期（长春市汽开区工商学院地块）_开工申请单_20250902','07093FFF-4E7E-EF11-B3A5-F40270D39969',1130, N'长春保利景阳和煦项目三期（长春市汽开区工商学院地块）', '2025-08-31',N'3b5fe483-5956-42ed-9e11-2679ec395270；dff36c5f-bdfc-407d-ba9c-42d0b5bcbb23；4d0e3bb4-0afc-427c-9ff3-f19f597d9acf；71a51205-e4bc-49c9-bc9f-85935c7994f1；583e35a6-6385-441c-b2be-5c262833e3ad；856ad3b5-3205-4d03-b1ab-7b0c83a3b6e8；7da3b4e5-6bff-4a32-8fbb-0f97b334665c；7d5a4e54-0de4-4685-bb8d-40e7c6e367a7', N'3b5fe483-5956-42ed-9e11-2679ec395270；dff36c5f-bdfc-407d-ba9c-42d0b5bcbb23；4d0e3bb4-0afc-427c-9ff3-f19f597d9acf；71a51205-e4bc-49c9-bc9f-85935c7994f1；583e35a6-6385-441c-b2be-5c262833e3ad；856ad3b5-3205-4d03-b1ab-7b0c83a3b6e8；7da3b4e5-6bff-4a32-8fbb-0f97b334665c；7d5a4e54-0de4-4685-bb8d-40e7c6e367a7', N'6#7#12#13#1#2#3#5', 7.5, 8.35, 3, 8.4, 8.35, 3.81, 4.54, 6.5, 5.2, 1.32, 3.88, 3.08, 1, NULL, 10626, 9424, 0.64, 0.0836, NULL)
GO
INSERT [dbo].[本次新推承诺表] ([本次新推量价承诺ID],[审批单号],[审批单名称], [项目GUID],[投管代码], [项目名称], [承诺时间],[本批开工的产品楼栋GUID], [本批开工的产品楼栋编码] ,[本批开工的产品楼栋名称], [本批开工可售面积], [本批开工货值], [供货周期], [去化周期], [本批开工后的项目累计签约回笼], [本批开工后的项目累计除地价外直投及费用], [本批开工后的项目累计贡献现金流], [本批开工后的一年内实现签约], [本批开工后的一年内实现回笼], [本批开工后的一年内除地价外直投及费用], [本批开工后的一年内贡献现金流], [未开工楼栋地价], [本次开工可收回地价], [回收股东占压资金], [本批开工的销售均价], [本批开工的可售单方成本], [本批开工的税后净利润], [本批开工的销净率], [业态销售均价及销净率承诺]) 
VALUES (newid(),'10501-2025-09-02','重庆公司保利贵阳大国璟项目（贵阳市观山湖区G〔18〕052地块）_开工申请单_20250902','32CC84D7-58F1-E811-80BF-E61F13C57837',10501, N'重庆公司保利贵阳大国璟项目（贵阳市观山湖区G〔18〕052地块）', '2025-08-31', N'9f8034c2-5978-4b27-8280-09bd521e8666；a675b7e4-bbdc-4320-8f7b-cbe8e93755c8', N'9f8034c2-5978-4b27-8280-09bd521e8666；a675b7e4-bbdc-4320-8f7b-cbe8e93755c8', N'住宅D7，住宅-D8', 3.99, 4.39, 4.5, 9, 4.39, 2.3, 2.09, 3.53, 2.99, 0.91, 2.08, 2.9, 0.72, 2.1, 11005, 9728, -0.13, -0.032, NULL)
GO
INSERT [dbo].[本次新推承诺表] ([本次新推量价承诺ID],[审批单号],[审批单名称], [项目GUID],[投管代码], [项目名称], [承诺时间],[本批开工的产品楼栋GUID], [本批开工的产品楼栋编码] ,[本批开工的产品楼栋名称], [本批开工可售面积], [本批开工货值], [供货周期], [去化周期], [本批开工后的项目累计签约回笼], [本批开工后的项目累计除地价外直投及费用], [本批开工后的项目累计贡献现金流], [本批开工后的一年内实现签约], [本批开工后的一年内实现回笼], [本批开工后的一年内除地价外直投及费用], [本批开工后的一年内贡献现金流], [未开工楼栋地价], [本次开工可收回地价], [回收股东占压资金], [本批开工的销售均价], [本批开工的可售单方成本], [本批开工的税后净利润], [本批开工的销净率], [业态销售均价及销净率承诺]) 
VALUES (newid(),'7216-2025-09-02','徐州学府项目（徐州市铜山XT2023-17凤凰路南大学路东地块）_开工申请单_20250902','4C2CD96B-15EB-EE11-B3A4-F40270D39969',7216, N'徐州学府项目（徐州市铜山XT2023-17凤凰路南大学路东地块）', '2025-08-31',N'ebb938c0-c0a9-48ce-a5c9-fbd2e663706d；04f47e92-383a-43d8-8dd6-78db3a761aec；40ca088a-72f2-405d-9a0c-5b10993be7f5；ba6fff14-eabc-42f4-87df-e1699b57531c', N'ebb938c0-c0a9-48ce-a5c9-fbd2e663706d；04f47e92-383a-43d8-8dd6-78db3a761aec；40ca088a-72f2-405d-9a0c-5b10993be7f5；ba6fff14-eabc-42f4-87df-e1699b57531c', N'住宅-14、住宅-19、住宅-21、住宅-22', 2.19, 1.83, 3, 6, 1.83, 1.08, 0.76, 1.5, 1.05, 0.49, 0.56, 0.61, 1.25, 0.76, 8390, 8769, -0.13, -0.0767, N'小高9300元/㎡，销净率1.47%
中高7623元/㎡ 销净率-17.56%')
GO

drop  table 本次新推承诺明细表
create table 本次新推承诺明细表(
    [本次新推量价承诺明细ID] uniqueidentifier NOT NULL PRIMARY KEY,
	[本次新推量价承诺ID] uniqueidentifier,
	[项目GUID] uniqueidentifier,
	[承诺时间] datetime NULL,
	[产品楼栋GUID] uniqueidentifier,
	[产品楼栋名称] nvarchar(255) NULL
    -- [承诺日开工可售面积] decimal(38,10),
    -- [承诺日开工货值] decimal(38,10),
    -- [承诺日供货周期] decimal(38,10),
    -- 承诺日去化周期  decimal(38,10),
	-- 承诺日累计签约回笼  decimal(38,10),
	-- 承诺日累计除地价外直投及费用  decimal(38,10),
	-- 承诺日累计贡献现金流  decimal(38,10),
	-- 承诺日一年内实现签约  decimal(38,10),
	-- 承诺日一年内签约回笼  decimal(38,10),
	-- 承诺日一年内除地价外直投及费用  decimal(38,10),
	-- 承诺日一年内贡献现金流  decimal(38,10), 
	-- 承诺日未开工楼栋地价  decimal(38,10),
	-- 承诺日本次开工可收回地价  decimal(38,10),
	-- 承诺日回收股东占压资金  decimal(38,10),
	-- 承诺日本批开工的销售均价  decimal(38,10),
    -- 承诺日本批开工的可售单方成本  decimal(38,10),
    -- 承诺日本批开工的税后净利润  decimal(38,10),
    -- 承诺日本批开工的销净  decimal(38,10)
)
-- 初始化数据
insert into [本次新推承诺明细表] ([本次新推量价承诺明细ID],本次新推量价承诺ID,项目GUID,[承诺时间],[产品楼栋GUID])
    SELECT
	    newid() as [本次新推量价承诺明细ID],
        a.本次新推量价承诺ID,
        a.项目GUID,
        a.承诺时间,
        value AS 产品楼栋GUID
    --INTO #cmtld
    FROM 本次新推承诺表 a
    CROSS APPLY dbo.fn_Split1(a.本批开工的产品楼栋编码, ';')
    WHERE ISNULL(a.本批开工的产品楼栋编码, '') <> '' and a.项目GUID ='EE075160-2116-EE11-B3A3-F40270D39969'
	and isnull(value,'')<>''



/****** [1.2 存货去化承诺表] ******/
drop table 存货去化承诺表

CREATE TABLE [dbo].[存货去化承诺表](
    [存货去化承诺ID] uniqueidentifier NOT NULL PRIMARY KEY,
    [审批单号] Varchar(200),
    [审批单名称] Varchar(200),
	[项目GUID] uniqueidentifier,
	[投管代码] Varchar(200),
	[项目名称] nvarchar(255) NULL,
	[承诺时间] datetime  NULL,
	[已开工未售部分的的产品楼栋编码] nvarchar(max) NULL,
	[已开工未售部分的的产品楼栋名称] nvarchar(max) NULL,
	[已开工未售部分的_售罄时间] datetime NULL,
	[已开工未售部分的销售均价] decimal(38,10) NULL,
	[已开工未售部分的去化周期] decimal(38,10) NULL,
	[已开工未售部分的税后净利润] decimal(38,10) NULL,
	[已开工未售部分的销净率] nvarchar(255) NULL,
	[业态级承诺_最低标准] nvarchar(255) NULL
) ON [PRIMARY] TEXTIMAGE_ON [PRIMARY]
GO


INSERT [dbo].[存货去化承诺表] ([存货去化承诺ID],[审批单号],[审批单名称], [项目GUID], [投管代码], [项目名称], [承诺时间], [已开工未售部分的的产品楼栋编码], [已开工未售部分的的产品楼栋名称], [已开工未售部分的_售罄时间], [已开工未售部分的销售均价], [已开工未售部分的去化周期], [已开工未售部分的税后净利润], [已开工未售部分的销净率], [业态级承诺_最低标准]) 
VALUES (newid(),'728-2025-09-02','长沙保利天瑞项目（长沙市岳麓区瓦官口路026项目）_开工申请单_20250902','EE075160-2116-EE11-B3A3-F40270D39969',728, N'长沙保利天瑞项目（长沙市岳麓区瓦官口路026项目）', '2025-08-31', N'99b67cf6-1cb1-49b5-92ee-1629bd85c5b7；c983b666-2b9f-46ad-adfe-1de79a542f2b；a4108c17-9d47-4a00-9774-65f40bc6ed3f；41d62c6c-e630-42a0-8db1-94104e90a6f6；90e37bc4-7f43-4b2c-a31c-f2e304126966；54f37ddf-c478-4523-a484-e6a7cc1df5aa；d2ce743b-4a1c-491f-ae0d-b0228a5b56ff；d2a21265-36cd-4181-ac58-8aaa0f071d98；bb50de8b-0caf-4a3e-ab07-5e82088afa8a；ab23cfe1-8a01-4cc2-954d-716497d81c44；f9f4fff3-c595-4f33-8796-c5e83f44488c；b93e47d7-a623-44f3-af70-e8f24e84d4d0；99a9297e-5a0a-4d41-a39a-3da9dac18014；7b0bf82d-3d06-4902-835e-1b4fa8203271；be82b344-c0ec-4cd7-8816-0812d45b868b；ac3e855e-05a4-47ed-9354-6dab6a0771dd', N'多层住宅Y17-mpbcy-1；多层住宅Y21-mpbcy-1；多层住宅Y29-mpbcy-1；多层住宅Y16-mpbcy-1；多层住宅Y13-mpbcy-1；多层住宅Y19-mpbcy-1；多层住宅Y18-mpbcy-1；多层住宅Y15-mpbcy-1；多层住宅Y24-mpbcy-1；多层住宅Y22-mpbcy-1；多层住宅Y20-mpbcy-1；多层住宅Y27-mpbcy-1；多层住宅Y25-mpbcy-1；多层住宅Y28-mpbcy-1；多层住宅Y23-mpbcy-1；多层住宅Y14-mpbcy-1', CAST(N'2026-12-01' AS DateTime), NULL, 17, -0.72, NULL, N'洋房住宅18300元/㎡，销净率-12%，税后利润不低于-0.72亿元')
GO
INSERT [dbo].[存货去化承诺表] ([存货去化承诺ID],[审批单号],[审批单名称], [项目GUID], [投管代码], [项目名称], [承诺时间], [已开工未售部分的的产品楼栋编码], [已开工未售部分的的产品楼栋名称], [已开工未售部分的_售罄时间], [已开工未售部分的销售均价], [已开工未售部分的去化周期], [已开工未售部分的税后净利润], [已开工未售部分的销净率], [业态级承诺_最低标准]) 
VALUES (newid(),'1130-2025-09-02','长春保利景阳和煦项目三期（长春市汽开区工商学院地块）_开工申请单_20250902','07093FFF-4E7E-EF11-B3A5-F40270D39969',1130, N'长春保利景阳和煦项目三期（长春市汽开区工商学院地块）', '2025-08-31', N'a86ec349-1da6-45d4-b65d-b9f5269a9871；ce103ce8-d771-476d-b251-40c304e6f111；66a6a17b-30ee-4df7-81cf-8a1e1684a404；7e42c261-833c-4565-9faf-1a4c8b9d9766；6eaae57e-a27d-4fa5-93ec-0c75a9165333；a4d01355-ffbc-4474-b9bf-933dad810622；09087e67-aead-45e8-8454-923a97d6eafb；bde4a961-e6f0-423f-9dfa-5cce6fc0986f；450f4532-f507-4d12-917b-e5cbd9bfd9e6；d0b3fe57-a878-49a7-a384-facfe22788a9；f588a8c8-e38a-411c-9a59-b2cbb57ba103；cb5c2c25-f29c-4c24-9384-519c625cc34d；6fb55354-a911-42c1-a38c-53ae1c5b0754', N'19栋-mpbcy-1；20栋-mpbcy-1；8栋-mpbcy-1；21栋-mpbcy-1；11栋-mpbcy-1；16栋-mpbcy-1；23栋-zxbcy-1；18栋-mpbcy-1；9栋-mpbcy-1；10栋-mpbcy-2；22栋-zxbcy-1；17栋-mpbcy-1；15栋-zxbcy-1', NULL, NULL, NULL, 0.93, NULL, N'中高层住宅预计售罄时间2025年9月，去化周期3个月
小高层住宅预计售罄时间2026年3月，去化周期9个月')
GO
INSERT [dbo].[存货去化承诺表] ([存货去化承诺ID],[审批单号],[审批单名称], [项目GUID], [投管代码], [项目名称], [承诺时间], [已开工未售部分的的产品楼栋编码], [已开工未售部分的的产品楼栋名称], [已开工未售部分的_售罄时间], [已开工未售部分的销售均价], [已开工未售部分的去化周期], [已开工未售部分的税后净利润], [已开工未售部分的销净率], [业态级承诺_最低标准]) 
VALUES (newid(),'10501-2025-09-02','重庆公司保利贵阳大国璟项目（贵阳市观山湖区G〔18〕052地块）_开工申请单_20250902','32CC84D7-58F1-E811-80BF-E61F13C57837',10501, N'重庆公司保利贵阳大国璟项目（贵阳市观山湖区G〔18〕052地块）', '2025-08-31', N'64f7dcf5-d85b-46eb-b020-e9322ecddce2；3b9159ab-078f-43db-9fd5-c82b9edb732f；32aee9c7-af74-476f-9f1f-bd5a9cb55017；a85cf74c-3e39-47db-9de3-4eb0fcba7f10；5fed74f7-2240-4041-bc3f-6d80414d633e；eebfe989-eb1e-46ae-ab27-9e2322d99267；389c800e-d2be-4b6a-938f-e7c4947defeb；b0f9781e-d4da-4278-bc65-e9cf313aeb39；9374136e-c102-477f-8f92-b594505c6ba0；41df1849-015f-4a0b-9a32-af981792773f；21ef5a1d-2074-4dcc-b399-50dff2df2276；13563d49-46a7-4b64-a673-1b96e61daa1b；0ba015ca-e8cd-4a33-b5e2-862481a2eeeb；8cae713f-8f5a-4c56-8e53-7f64959e3faa；8dd0b3ca-522d-4168-a5f1-5b0625e7480c；95f1efa1-aea9-4ada-bfa5-57787eadeb40；fb736095-99b0-4e09-bc6e-476e15d8fb1a；1d95e42a-228c-47b9-87b1-0695cc2953fb；5356fe2a-fa83-4b0e-a352-acca098ae74f', N'A22-mpbcy-1；B3（错跃）-mpbcy-1；A13-mpbcy-1；A8-mpbcy-1；C4-zxbcy-1；C11-mpbcy-1；C14-mpbcy-1；C10-mpbcy-1；C7-mpbcy-1；A6-mpbcy-1；C8-mpbcy-1；C12-mpbcy-1；A7-mpbcy-1；E1（公租房）-zxbcy-2；A21-mpbcy-1；C13-mpbcy-1；A16-mpbcy-1；C6-zxbcy-1；C5-mpbcy-1', CAST(N'2025-11-01' AS DateTime), 10000, 4, -1, NULL, NULL)
GO
INSERT [dbo].[存货去化承诺表] ([存货去化承诺ID],[审批单号],[审批单名称], [项目GUID], [投管代码], [项目名称], [承诺时间], [已开工未售部分的的产品楼栋编码], [已开工未售部分的的产品楼栋名称], [已开工未售部分的_售罄时间], [已开工未售部分的销售均价], [已开工未售部分的去化周期], [已开工未售部分的税后净利润], [已开工未售部分的销净率], [业态级承诺_最低标准]) 
VALUES (newid(),'7216-2025-09-02','徐州学府项目（徐州市铜山XT2023-17凤凰路南大学路东地块）_开工申请单_20250902','4C2CD96B-15EB-EE11-B3A4-F40270D39969',7216, N'徐州学府项目（徐州市铜山XT2023-17凤凰路南大学路东地块）', '2025-08-31', N'72daffef-3da4-45db-aae0-59b8f3c0afd3；72a826aa-cbc7-477e-9349-9ee2161381e1；44200e84-c041-48e6-81a8-6917e786984a；0f6aa9cc-5c54-4b1c-a4a6-02437b9914f3；d4c8f3c0-1248-41fe-bd0c-060fd5c0ec12；8d2f595c-c638-4b01-9937-d3218a68929c；18c25c0e-47a8-4fd6-a9da-030465ea2f4e', N'20栋-mpbcy-1；3栋-mpbcy-1；13栋-mpbcy-1；9栋-mpbcy-1；1栋-mpbcy-1；10栋-mpbcy-1；12栋-mpbcy-1', CAST(N'2025-10-01' AS DateTime), NULL, 2.33, -0.06, NULL, N'小高住宅9210元/㎡，销净率不低于0.72%，税后利润不低于0.003亿元
中高住宅7993元/㎡，销净率不低于-12.39%，税后利润不低于-0.06亿元')
GO

drop  table  存货去化承诺明细表;
-- 存货去化承诺明细表
create  TABLE [存货去化承诺明细表]
(   [存货去化承诺明细ID] uniqueidentifier NOT NULL PRIMARY KEY,
	[存货去化承诺ID] uniqueidentifier,
	[项目GUID] uniqueidentifier,
	[承诺时间] datetime NULL,
	[产品楼栋GUID] uniqueidentifier,
	[产品楼栋名称] nvarchar(255) NULL,
    [承诺日累计签约面积] decimal(38,10),
    [承诺日累计签约金额] decimal(38,10),
    [承诺日累计不含税签约金额] decimal(38,10)
)

-- 初始化数据
insert into [存货去化承诺明细表] ([存货去化承诺明细ID],存货去化承诺ID,项目GUID,[承诺时间],[产品楼栋GUID])
    SELECT
	    newid() as [存货去化承诺明细ID],
        a.存货去化承诺ID,
        a.项目GUID,
        a.承诺时间,
        value AS 产品楼栋GUID
    --INTO #cmtld
    FROM 存货去化承诺表 a
    CROSS APPLY dbo.fn_Split1(a.已开工未售部分的的产品楼栋编码, ';')
    WHERE ISNULL(a.已开工未售部分的的产品楼栋编码, '') <> '';


update a  
set  
	a.产品楼栋名称 =isnull(b.BldName,b.bldcode),
	a.承诺日累计不含税签约金额=b.承诺日累计签约金额不含税,
	a.承诺日累计签约金额=b.承诺日累计签约面积,
	a.承诺日累计签约面积=b.承诺日累计签约面积
from  [存货去化承诺明细表] a
left join (
	 SELECT 
            sale.ParentProjGUID,
            sale.BldGUID,
			sale.bldcode,
			sale.BldName,
            SUM(
                CASE 
                    WHEN DATEDIFF(DAY,'2025-08-01', StatisticalDate) >= 0 
                        THEN ISNULL(Sale.CNetAmount, 0) + ISNULL(Sale.SpecialCNetAmount, 0) 
                    ELSE 0 
                END
            ) / 100000000.0 AS 承诺日累计签约金额,
            SUM(
                CASE 
                    WHEN DATEDIFF(DAY, '2025-08-01', StatisticalDate) >= 0 
                        THEN ISNULL(Sale.CNetAmountNotTax, 0) + ISNULL(Sale.SpecialCNetAmountNotTax, 0) 
                    ELSE 0 
                END
            ) / 100000000.0 AS 承诺日累计签约金额不含税,
            SUM(
                CASE 
                    WHEN DATEDIFF(DAY, '2025-08-01', StatisticalDate) >= 0 
                        THEN ISNULL(Sale.CNetArea, 0) + ISNULL(Sale.SpecialCNetArea, 0) 
                    ELSE 0 
                END
            ) / 10000.0 AS 承诺日累计签约面积
        FROM [172.16.4.161].[HighData_prod].dbo.data_wide_dws_s_SalesPerf Sale
		inner join [存货去化承诺明细表] ch on ch.产品楼栋GUID =sale.BldGUID 
		group by  sale.ParentProjGUID,
            sale.BldGUID,sale.bldcode,sale.BldName
) b on a.产品楼栋GUID =b.BldGUID